OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f86k90.h
extern __at(0x0F6A) __sfr LCDDATA4;

typedef struct
  {
  unsigned S32C0                : 1;
  unsigned S33C0                : 1;
  unsigned S34C0                : 1;
  unsigned S35C0                : 1;
  unsigned S36C0                : 1;
  unsigned S37C0                : 1;
  unsigned S38C0                : 1;
  unsigned S39C0                : 1;
  } __LCDDATA4bits_t;

extern __at(0x0F6A) volatile __LCDDATA4bits_t LCDDATA4bits;

#define _S32C0                  0x01
#define _S33C0                  0x02
#define _S34C0                  0x04
#define _S35C0                  0x08
#define _S36C0                  0x10
#define _S37C0                  0x20
#define _S38C0                  0x40
#define _S39C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA5 Bits

extern __at(0x0F6B) __sfr LCDDATA5;

typedef struct
  {
  unsigned S40C0                : 1;
  unsigned S41C0                : 1;
  unsigned S42C0                : 1;
  unsigned S43C0                : 1;
  unsigned S44C0                : 1;
  unsigned S45C0                : 1;
  unsigned S46C0                : 1;
  unsigned S47C0                : 1;
  } __LCDDATA5bits_t;

extern __at(0x0F6B) volatile __LCDDATA5bits_t LCDDATA5bits;

#define _S40C0                  0x01
#define _S41C0                  0x02
#define _S42C0                  0x04
#define _S43C0                  0x08
#define _S44C0                  0x10
#define _S45C0                  0x20
#define _S46C0                  0x40
#define _S47C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA6 Bits

extern __at(0x0F6C) __sfr LCDDATA6;

typedef struct
  {
  unsigned S00C1                : 1;
  unsigned S01C1                : 1;
  unsigned S02C1                : 1;
  unsigned S03C1                : 1;
  unsigned S04C1                : 1;
  unsigned S05C1                : 1;
  unsigned S06C1                : 1;
  unsigned S07C1                : 1;
  } __LCDDATA6bits_t;

extern __at(0x0F6C) volatile __LCDDATA6bits_t LCDDATA6bits;

#define _S00C1                  0x01
#define _S01C1                  0x02
#define _S02C1                  0x04
#define _S03C1                  0x08
#define _S04C1                  0x10
#define _S05C1                  0x20
#define _S06C1                  0x40
#define _S07C1                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA7 Bits

extern __at(0x0F6D) __sfr LCDDATA7;

typedef struct
  {
  unsigned S08C1                : 1;
  unsigned S09C1                : 1;
  unsigned S10C1                : 1;
  unsigned S11C1                : 1;
  unsigned S12C1                : 1;
  unsigned S13C1                : 1;
  unsigned S14C1                : 1;
  unsigned S15C1                : 1;
  } __LCDDATA7bits_t;

extern __at(0x0F6D) volatile __LCDDATA7bits_t LCDDATA7bits;

#define _S08C1                  0x01
#define _S09C1                  0x02
#define _S10C1                  0x04
#define _S11C1                  0x08
#define _S12C1                  0x10
#define _S13C1                  0x20
#define _S14C1                  0x40
#define _S15C1                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA8 Bits

extern __at(0x0F6E) __sfr LCDDATA8;

typedef struct
  {
  unsigned S16C1                : 1;
  unsigned S17C1                : 1;
  unsigned S18C1                : 1;
  unsigned S19C1                : 1;
  unsigned S20C1                : 1;
  unsigned S21C1                : 1;
  unsigned S22C1                : 1;
  unsigned S23C1                : 1;
  } __LCDDATA8bits_t;

extern __at(0x0F6E) volatile __LCDDATA8bits_t LCDDATA8bits;

#define _S16C1                  0x01
#define _S17C1                  0x02
#define _S18C1                  0x04
#define _S19C1                  0x08
#define _S20C1                  0x10
#define _S21C1                  0x20
#define _S22C1                  0x40
#define _S23C1                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA9 Bits

extern __at(0x0F6F) __sfr LCDDATA9;

typedef struct
  {
  unsigned S24C1                : 1;
  unsigned S25C1                : 1;
  unsigned S26C1                : 1;
  unsigned S27C1                : 1;
  unsigned S28C1                : 1;
  unsigned S29C1                : 1;
  unsigned S30C1                : 1;
  unsigned S31C1                : 1;
  } __LCDDATA9bits_t;

extern __at(0x0F6F) volatile __LCDDATA9bits_t LCDDATA9bits;

#define _S24C1                  0x01
#define _S25C1                  0x02
#define _S26C1                  0x04
#define _S27C1                  0x08
#define _S28C1                  0x10
#define _S29C1                  0x20
#define _S30C1                  0x40
#define _S31C1                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA10 Bits

extern __at(0x0F70) __sfr LCDDATA10;

typedef struct
  {
  unsigned S32C1                : 1;
  unsigned S33C1                : 1;
  unsigned S34C1                : 1;
  unsigned S35C1                : 1;
  unsigned S36C1                : 1;
  unsigned S37C1                : 1;
  unsigned S38C1                : 1;
  unsigned S39C1                : 1;
  } __LCDDATA10bits_t;

extern __at(0x0F70) volatile __LCDDATA10bits_t LCDDATA10bits;

#define _S32C1                  0x01
#define _S33C1                  0x02
#define _S34C1                  0x04
#define _S35C1                  0x08
#define _S36C1                  0x10
#define _S37C1                  0x20
#define _S38C1                  0x40
#define _S39C1                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA11 Bits

extern __at(0x0F71) __sfr LCDDATA11;

typedef struct
  {
  unsigned S40C1                : 1;
  unsigned S41C1                : 1;
  unsigned S42C1                : 1;
  unsigned S43C1                : 1;
  unsigned S44C1                : 1;
  unsigned S45C1                : 1;
  unsigned S46C1                : 1;
  unsigned S47C1                : 1;
  } __LCDDATA11bits_t;

extern __at(0x0F71) volatile __LCDDATA11bits_t LCDDATA11bits;

#define _S40C1                  0x01
#define _S41C1                  0x02
#define _S42C1                  0x04
#define _S43C1                  0x08
#define _S44C1                  0x10
#define _S45C1                  0x20
#define _S46C1                  0x40
#define _S47C1                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA12 Bits

