OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f86k90.h
extern __at(0x0F72) __sfr LCDDATA12;

typedef struct
  {
  unsigned S00C2                : 1;
  unsigned S01C2                : 1;
  unsigned S02C2                : 1;
  unsigned S03C2                : 1;
  unsigned S04C2                : 1;
  unsigned S05C2                : 1;
  unsigned S06C2                : 1;
  unsigned S07C2                : 1;
  } __LCDDATA12bits_t;

extern __at(0x0F72) volatile __LCDDATA12bits_t LCDDATA12bits;

#define _S00C2                  0x01
#define _S01C2                  0x02
#define _S02C2                  0x04
#define _S03C2                  0x08
#define _S04C2                  0x10
#define _S05C2                  0x20
#define _S06C2                  0x40
#define _S07C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA13 Bits

extern __at(0x0F73) __sfr LCDDATA13;

typedef struct
  {
  unsigned S08C2                : 1;
  unsigned S09C2                : 1;
  unsigned S10C2                : 1;
  unsigned S11C2                : 1;
  unsigned S12C2                : 1;
  unsigned S13C2                : 1;
  unsigned S14C2                : 1;
  unsigned S15C2                : 1;
  } __LCDDATA13bits_t;

extern __at(0x0F73) volatile __LCDDATA13bits_t LCDDATA13bits;

#define _S08C2                  0x01
#define _S09C2                  0x02
#define _S10C2                  0x04
#define _S11C2                  0x08
#define _S12C2                  0x10
#define _S13C2                  0x20
#define _S14C2                  0x40
#define _S15C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA14 Bits

extern __at(0x0F74) __sfr LCDDATA14;

typedef struct
  {
  unsigned S16C2                : 1;
  unsigned S17C2                : 1;
  unsigned S18C2                : 1;
  unsigned S19C2                : 1;
  unsigned S20C2                : 1;
  unsigned S21C2                : 1;
  unsigned S22C2                : 1;
  unsigned S23C2                : 1;
  } __LCDDATA14bits_t;

extern __at(0x0F74) volatile __LCDDATA14bits_t LCDDATA14bits;

#define _S16C2                  0x01
#define _S17C2                  0x02
#define _S18C2                  0x04
#define _S19C2                  0x08
#define _S20C2                  0x10
#define _S21C2                  0x20
#define _S22C2                  0x40
#define _S23C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA15 Bits

extern __at(0x0F75) __sfr LCDDATA15;

typedef struct
  {
  unsigned S24C2                : 1;
  unsigned S25C2                : 1;
  unsigned S26C2                : 1;
  unsigned S27C2                : 1;
  unsigned S28C2                : 1;
  unsigned S29C2                : 1;
  unsigned S30C2                : 1;
  unsigned S31C2                : 1;
  } __LCDDATA15bits_t;

extern __at(0x0F75) volatile __LCDDATA15bits_t LCDDATA15bits;

#define _S24C2                  0x01
#define _S25C2                  0x02
#define _S26C2                  0x04
#define _S27C2                  0x08
#define _S28C2                  0x10
#define _S29C2                  0x20
#define _S30C2                  0x40
#define _S31C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA16 Bits

extern __at(0x0F76) __sfr LCDDATA16;

typedef struct
  {
  unsigned S32C2                : 1;
  unsigned S33C2                : 1;
  unsigned S34C2                : 1;
  unsigned S35C2                : 1;
  unsigned S36C2                : 1;
  unsigned S37C2                : 1;
  unsigned S38C2                : 1;
  unsigned S39C2                : 1;
  } __LCDDATA16bits_t;

extern __at(0x0F76) volatile __LCDDATA16bits_t LCDDATA16bits;

#define _S32C2                  0x01
#define _S33C2                  0x02
#define _S34C2                  0x04
#define _S35C2                  0x08
#define _S36C2                  0x10
#define _S37C2                  0x20
#define _S38C2                  0x40
#define _S39C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA17 Bits

extern __at(0x0F77) __sfr LCDDATA17;

typedef struct
  {
  unsigned S40C2                : 1;
  unsigned S41C2                : 1;
  unsigned S42C2                : 1;
  unsigned S43C2                : 1;
  unsigned S44C2                : 1;
  unsigned S45C2                : 1;
  unsigned S46C2                : 1;
  unsigned S47C2                : 1;
  } __LCDDATA17bits_t;

extern __at(0x0F77) volatile __LCDDATA17bits_t LCDDATA17bits;

#define _S40C2                  0x01
#define _S41C2                  0x02
#define _S42C2                  0x04
#define _S43C2                  0x08
#define _S44C2                  0x10
#define _S45C2                  0x20
#define _S46C2                  0x40
#define _S47C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA18 Bits

extern __at(0x0F78) __sfr LCDDATA18;

typedef struct
  {
  unsigned S00C3                : 1;
  unsigned S01C3                : 1;
  unsigned S02C3                : 1;
  unsigned S03C3                : 1;
  unsigned S04C3                : 1;
  unsigned S05C3                : 1;
  unsigned S06C3                : 1;
  unsigned S07C3                : 1;
  } __LCDDATA18bits_t;

extern __at(0x0F78) volatile __LCDDATA18bits_t LCDDATA18bits;

#define _S00C3                  0x01
#define _S01C3                  0x02
#define _S02C3                  0x04
#define _S03C3                  0x08
#define _S04C3                  0x10
#define _S05C3                  0x20
#define _S06C3                  0x40
#define _S07C3                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA19 Bits

extern __at(0x0F79) __sfr LCDDATA19;

typedef struct
  {
  unsigned S08C3                : 1;
  unsigned S09C3                : 1;
  unsigned S10C3                : 1;
  unsigned S11C3                : 1;
  unsigned S12C3                : 1;
  unsigned S13C3                : 1;
  unsigned S14C3                : 1;
  unsigned S15C3                : 1;
  } __LCDDATA19bits_t;

extern __at(0x0F79) volatile __LCDDATA19bits_t LCDDATA19bits;

#define _S08C3                  0x01
#define _S09C3                  0x02
#define _S10C3                  0x04
#define _S11C3                  0x08
#define _S12C3                  0x10
#define _S13C3                  0x20
#define _S14C3                  0x40
#define _S15C3                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA20 Bits

